In [1]:
import pandas as pd
import numpy as np

In [23]:
data =  {'eng':[10,30,50,70],
         'kor':[20,40,60,80],
         'math':[90,50,20,70]}
df = pd.DataFrame(data,index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [ ]:
#산술,관계,논리

In [4]:
df*2

   eng  kor  math
a   20   40   180
b   60   80   100
c  100  120    40
d  140  160   140

In [7]:
df['eng']=2

In [9]:
df['eng']=[1,2,3,4]

In [11]:
df['eng']= df['eng']+2

In [16]:
df.loc['b']=2

In [17]:
df.loc['b']

eng     2
kor     2
math    2
Name: b, dtype: int64

In [18]:
df.loc['b']=[1,2,3]

In [20]:
df.loc['c':,'kor':]

   kor  math
c   60    20
d   80    70

In [21]:
df.loc['c':,'kor':]=df.loc['c':,'kor':]+2

In [25]:
#행단위 boolean indexing
df[[True,False,True,True]]

   eng  kor  math
a   10   20    90
c   50   60    20
d   70   80    70

In [27]:
df['eng']>30

a    False
b    False
c     True
d     True
Name: eng, dtype: bool

In [28]:
df[df['eng']>30]

   eng  kor  math
c   50   60    20
d   70   80    70

In [30]:
(df['kor']==40)|(df['kor']==80)

a    False
b     True
c    False
d     True
Name: kor, dtype: bool

In [31]:
df[(df['kor']==40)|(df['kor']==80)]

   eng  kor  math
b   30   40    50
d   70   80    70

In [32]:
df.query('eng>30')

   eng  kor  math
c   50   60    20
d   70   80    70

In [34]:
# df[ (df['kor']==40) | (df['kor']==80) ]
df.query( 'kor==40 or kor==80' )

   eng  kor  math
b   30   40    50
d   70   80    70

In [35]:
df.query( '20<=kor<50' )

   eng  kor  math
a   10   20    90
b   30   40    50

In [36]:
n = 30
s = f'n={n}'
s

'n=30'

In [38]:
n = 30
df.query( f'eng>{n}')

   eng  kor  math
c   50   60    20
d   70   80    70

In [24]:
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70